let CSCoursesCSV = 
`فيزياء لائحة قديمة;G1;د.;BSC124;31,32,33,44,45;3;BSC124 G1;
لغة إنجليزية(1) لائحة قديمة;G1;د.;BSC114;24,25;1;BSC114 G1;
مقدمة حاسبات لائحة قديمة;G1;د.عماد - م.بسنت;CSC110;51,52,53,26,27,28;4;CSC110 G1;
رياضة(١) لائحة قديمة;G1;د.;BSC110;54,55,56,36,37;3;BSC110 G1;
مقرر ثقافى (١)  لائحة قديمة;G1;د.;HUM110;41,42;1;HUM110 G1;
تربية رياضية (١) لائحة قديمة;G1;د.;PHE110;57,58;1;PHE110 G1;
البرمجة الشيئية;G1;أ.م.د. وليد خضر - م.م كريم;CSC210;11,12,13,21,22,23;4;CSC210 G1;
البرمجة الشيئية;G2;أ.م.د. وليد خضر - م.أية;CSC210;14,15,16,41,42,43;4;CSC210 G2;
البرمجة الشيئية;G3;د.أحمد جادالله - م.م نبيل;CSC210;21,22,23,36,37,38;4;CSC210 G3;
البرمجة الشيئية;G4;د.أحمد جادالله - م.آيه;CSC210;24,25,26,31,32,33;4;CSC210 G4;
البرمجة الشيئية;G5;أ.م.د. وليد خضر - م.نبيل;CSC210;11,12,13,24,25,26;4;CSC210 G5;
البرمجة الشيئية;G6;أ.م.د. وليد خضر - م.كريـــم;CSC210;14,15,16,24,25,26;4;CSC210 G6;
البرمجة الشيئية;G7;د.أحمد جادالله - م.نبيل;CSC210;21,22,23,36,37,38;4;CSC210 G7;
البرمجة الشيئية;G8;د.أحمد جادالله - م.كريــم;CSC210;24,25,26,41,42,43;4;CSC210 G8;
لغة إنجليزية(٣);G1;د.;BSC214;14,15;1;BSC214 G1;
لغة إنجليزية(٣);G2;د.;BSC214;17,18;1;BSC214 G2;
لغة إنجليزية(٣);G3;د.;BSC214;47,48;1;BSC214 G3;
لغة إنجليزية(٣);G4;د.;BSC214;27,28;1;BSC214 G4;
لغة إنجليزية(٣);G5;د.;BSC214;14,15;1;BSC214 G5;
لغة إنجليزية(٣);G6;د.;BSC214;17,18;1;BSC214 G6;
لغة إنجليزية(٣);G7;د.;BSC214;47,48;1;BSC214 G7;
لغة إنجليزية(٣);G8;د.;BSC214;27,28;1;BSC214 G8;
رياضة(٣);G1;د.محمد ابوزيد;BSC210;34,35,36,27,28;3;BSC210 G1;
رياضة(٣);G2;د.;BSC210;31,32,33,27,28;3;BSC210 G2;
رياضة(٣);G3;د.فرحات;BSC210;51,52,53,41,42;3;BSC210 G3;
رياضة(٣);G4;د.فرحات;BSC210;54,55,56,44,45;3;BSC210 G4;
رياضة(٣);G5;د.محمد ابو زيد;BSC210;34,35,36,27,28;3;BSC210 G5;
رياضة(٣);G6;د.;BSC210;31,32,33,27,28;3;BSC210 G6;
رياضة(٣);G7;د.فرحات;BSC210;51,52,53,41,42;3;BSC210 G7;
رياضة(٣);G8;د.;BSC210;54,55,56,44,45;3;BSC210 G8;
مقدمة نظم معلومات;G1;د.رانيا رجب - م.م سارة ;INF211;31,32,33,41,42;3;INF211 G1;
مقدمة نظم معلومات;G2;د.رانيا رجب - م.م منى;INF211;34,35,36,24,25;3;INF211 G2;
مقدمة نظم معلومات;G3;د.عادل محمد خالد - م.م سارة;INF211;14,15,16,34,35;3;INF211 G3;
مقدمة نظم معلومات;G4;د.عادل محمد خالد - م.م سارة;INF211;11,12,13,37,38;3;INF211 G4;
مقدمة نظم معلومات;G5;د.رانيا رجب - م.م سارة;INF211;31,32,33,44,45;3;INF211 G5;
مقدمة نظم معلومات;G6;د.رانيا رجب - م.مني ;INF211;34,35,36,47,48;3;INF211 G6;
مقدمة نظم معلومات;G7;د.عادل محمد خالد - م.بسنت;INF211;14,15,16,44,45;3;INF211 G7;
مقدمة نظم معلومات;G8;د.عادل محمد خالد - م.مني ;INF211;11,12,13,31,32;3;INF211 G8;
تصميم منطقي;G1;د.أحمد مجدي - م.م دينا;BSC215;51,52,53,37,38;3;BSC215 G1;
تصميم منطقي;G2;د.أحمد مجدي - م.م عبدالهادي;BSC215;56,57,58,11,12;3;BSC215 G2;
تصميم منطقي;G3;د.معتصم الشوربجي - م.م دينا;BSC215;11,12,13,44,45;3;BSC215 G3;
تصميم منطقي;G4;د.معتصم الشوربجي - م.عبدالهادي;BSC215;14,15,16,57,58;3;BSC215 G4;
تصميم منطقي;G5;د.أحمد مجدي - م.عبدالهادي;BSC215;51,52,53,54,55;3;BSC215 G5;
تصميم منطقي;G6;د.أحمد مجدي - م.عبدالهادي;BSC215;56,57,58,11,12;3;BSC215 G6;
تصميم منطقي;G7;د.معتصم الشوربجي - م.دينا;BSC215;11,12,13,34,35;3;BSC215 G7;
تصميم منطقي;G8;د.معتصم الشوربجي - م.عبدالهادي;BSC215;14,15,16,57,58;3;BSC215 G8;
هياكل بيانات;G1;د.عمرو عبداللطيف - م. شروق;INF210;56,57,58,44,45;3;INF210 G1;
هياكل بيانات;G2;د.عمرو عبداللطيف - م.الاء;INF210;51,52,53,54,55;3;INF210 G2;
هياكل بيانات;G3;د.أحمد ناصر - م. شروق;INF210;24,25,26,57,58;3;INF210 G3;
هياكل بيانات;G4;د.أحمد ناصر - م.آلاء;INF210;21,22,23,34,35;3;INF210 G4;
هياكل بيانات;G5;د.عمرو عبداللطيف - م.آلاء;INF210;56,57,58,41,42;3;INF210 G5;
هياكل بيانات;G6;د.عمرو عبداللطيف - م.شروق;INF210;51,52,53,54,55;3;INF210 G6;
هياكل بيانات;G7;د.أحمد ناصر - م.شروق;INF210;24,25,26,31,32;3;INF210 G7;
هياكل بيانات;G8;د.أحمد ناصر - م.آلاء;INF210;21,22,23,37,38;3;INF210 G8;
مبادئ إدارة;G1;د.;BSC213;47,48;1;BSC213 G1;
مبادئ إدارة;G2;د.;BSC213;44,45;1;BSC213 G2;
مبادئ إدارة;G3;د.;BSC213;54,55;1;BSC213 G3;
مبادئ إدارة;G4;د.;BSC213;51,52;1;BSC213 G4;
مبادئ إدارة;G5;د.;BSC213;47,48;1;BSC213 G5;
مبادئ إدارة;G6;د.;BSC213;44,45;1;BSC213 G6;
مبادئ إدارة;G7;د.;BSC213;54,55;1;BSC213 G7;
مبادئ إدارة;G8;د.;BSC213;51,52;1;BSC213 G8;
بناء وتنظيم نظم الحاسبات ولغة التجميع;G1;د.أسامة الكومي - م.كريـم;CSC313;11,12,13,51,52,53;4;CSC313 G1;
بناء وتنظيم نظم الحاسبات ولغة التجميع;G2;د.أسامة الكومي - م.نبيل;CSC313;14,15,16,51,52,53;4;CSC313 G2;
بناء وتنظيم نظم الحاسبات ولغة التجميع;G3;د.أسامة حلمي - م.كريم;CSC313;34,35,36,56,57,58;4;CSC313 G3;
بناء وتنظيم نظم الحاسبات ولغة التجميع;G4;د.أسامة حلمي - م.نبيل;CSC313;31,32,33,21,22,23;4;CSC313 G4;
بناء وتنظيم نظم الحاسبات ولغة التجميع;G5;د.ايمن سليمان - م.م كريم;CSC313;54,55,56,31,32,33;4;CSC313 G5;
بناء وتنظيم نظم الحاسبات ولغة التجميع;G6;د.أسامة الكومي - م.م نبيل;CSC313;11,12,13,43,44,45;4;CSC313 G6;
بناء وتنظيم نظم الحاسبات ولغة التجميع;G7;د.أسامة الكومي - م.م نبيل;CSC313;14,15,16,46,47,48;4;CSC313 G7;
بناء وتنظيم نظم الحاسبات ولغة التجميع;G8;د.أسامة حلمي - م. ايمان;CSC313;34,35,36,26,27,28;4;CSC313 G8;
بناء وتنظيم نظم الحاسبات ولغة التجميع;G9;د.أسامة حلمي - م. ايمان;CSC313;31,32,33,46,47,48;4;CSC313 G9;
بناء وتنظيم نظم الحاسبات ولغة التجميع;G10;د.ايمن سليمان - م. ايمان;CSC313;54,55,56,36,37,38;4;CSC313 G10;
تراسل البيانات;G1;د.نبيل لاشين - م.شروق;BSC311;14,15,16,41,42;3;BSC311 G1;
تراسل البيانات;G2;د.نبيل لاشين - م.شروق;BSC311;11,12,13,47,48;3;BSC311 G2;
تراسل البيانات;G3;د. - م.شروق -  م.دينا ;BSC311;31,32,33,54,55;3;BSC311 G3;
تراسل البيانات;G4;د. - م.شروق -  م.دينا ;BSC311;34,35,36,51,52;3;BSC311 G4;
تراسل البيانات;G5;د.ايمن سليمان -  م. شروق ;BSC311;51,52,53,24,25;3;BSC311 G5;
تراسل البيانات;G6;د. نبيل لاشين -  م. شروق ;BSC311;14,15,16,34,35;3;BSC311 G6;
تراسل البيانات;G7;د. نبيل لاشين -  م. ايمان;BSC311;11,12,13,44,45;3;BSC311 G7;
تراسل البيانات;G8;د. -  م. ايمان;BSC311;31,32,33,24,25;3;BSC311 G8;
تراسل البيانات;G9;د. -  م. ايمان;BSC311;34,35,36,57,58;3;BSC311 G9;
تراسل البيانات;G10;د.ايمن سليمان -  م. ايمان;BSC311;51,52,53,21,22;3;BSC311 G10;
تصميم نظم معلومات;G1;أ.د.رشدي فاروق - م.نادين;INF310;21,22,23,34,35;3;INF310 G1;
تصميم نظم معلومات;G2;أ.د.رشدي فاروق - م.نادين;INF310;24,25,26,37,38;3;INF310 G2;
تصميم نظم معلومات;G3;د. - م.سمر;INF310;14,15,16,41,42;3;INF310 G3;
تصميم نظم معلومات;G4;د. - م.سمر;INF310;11,12,13,47,48;3;INF310 G4;
تصميم نظم معلومات;G5;د. - م.سمر;INF310;41,42,43,57,58;3;INF310 G5;
تصميم نظم معلومات;G6;د. - م.سمر;INF310;21,22,23,17,18;3;INF310 G6;
تصميم نظم معلومات;G7;أ.د.رشدي فاروق - م. سمر;INF310;24,25,26,37,38;3;INF310 G7;
تصميم نظم معلومات;G8;د. - م. سمر;INF310;14,15,16,54,55;3;INF310 G8;
تصميم نظم معلومات;G9;د. - م. سمر;INF310;11,12,13,44,45;3;INF310 G9;
تصميم نظم معلومات;G10;د. - م. سمر;INF310;41,42,43,24,25;3;INF310 G10;
واجهات الحاسبات وطرفياتها;G1;د.نادر - م.نادين;CSC310;36,37,38,57,58;3;CSC310 G1;
واجهات الحاسبات وطرفياتها;G2;د.نادر - م.نادين;CSC310;31,32,33,54,55;3;CSC310 G2;
واجهات الحاسبات وطرفياتها;G3;د.نادر - م.آيه;CSC310;51,52,53,44,45;3;CSC310 G3;
واجهات الحاسبات وطرفياتها;G4;د.نادر - م;CSC310;54,55,56,24,25;3;CSC310 G4;
واجهات الحاسبات وطرفياتها;G5;د. - م.آيه;CSC310;14,15,16,47,48;3;CSC310 G5;
واجهات الحاسبات وطرفياتها;G6;د.نادر - م.آيه;CSC310;36,37,38,54,55;3;CSC310 G6;
واجهات الحاسبات وطرفياتها;G7;د.نادر - م.آيه;CSC310;31,32,33,27,28;3;CSC310 G7;
واجهات الحاسبات وطرفياتها;G8;د.نادر - م.آيه;CSC310;51,52,53,57,58;3;CSC310 G8;
واجهات الحاسبات وطرفياتها;G9;د.نادر - م.آيه;CSC310;54,55,56,21,22;3;CSC310 G9;
واجهات الحاسبات وطرفياتها;G10;د. - م.آيه;CSC310;14,15,16,34,35;3;CSC310 G10;
نظم ادارة قواعد البيانات (١);G1;د.أسماء حنفي - م.شيماء;INF311;31,32,33,46,47,48;4;INF311 G1;
نظم ادارة قواعد البيانات (١);G2;د.أسماء حنفي - م.شيماء;INF311;34,35,36,43,44,45;4;INF311 G2;
نظم ادارة قواعد البيانات (١);G3;د. - م.شروق;INF311;11,12,13,26,27,28;4;INF311 G3;
نظم ادارة قواعد البيانات (١);G4;د. - م.شروق;INF311;14,15,16,26,27,28;4;INF311 G4;
نظم ادارة قواعد البيانات (١);G5;د. - م.شروق;INF311;44,45,46,36,37,38;4;INF311 G5;
نظم ادارة قواعد البيانات (١);G6;د.أسماء حنفي - م. ألاء;INF311;31,32,33,56,57,58;4;INF311 G6;
نظم ادارة قواعد البيانات (١);G7;د.أسماء حنفي - م. ألاء;INF311;34,35,36,51,52,53;4;INF311 G7;
نظم ادارة قواعد البيانات (١);G8;د. - م. سمر;INF311;11,12,13,21,22,23;4;INF311 G8;
نظم ادارة قواعد البيانات (١);G9;د. - م. سمر;INF311;14,15,16,51,52,53;4;INF311 G9;
نظم ادارة قواعد البيانات (١);G10;د. - م. ;INF311;44,45,46,26,27,28;4;INF311 G10;
لغة إنجليزية(٤);G1;د.;BSC320;24,25;1;BSC320 G1;
لغة إنجليزية(٤);G2;د.;BSC320;41,42;1;BSC320 G2;
لغة إنجليزية(٤);G6;د.;BSC320;24,25;1;BSC320 G6;
لغة إنجليزية(٤);G7;د.;BSC320;41,42;1;BSC320 G7;
مقرر ثقافى (٢);G1;د.;HUM320;26,27;1;HUM320 G1;
مقرر ثقافى (٢);G2;د.;HUM320;21,22;1;HUM320 G2;
مقرر ثقافى (٢);G6;د.;HUM320;26,27;1;HUM320 G6;
مقرر ثقافى (٢);G7;د.;HUM320;21,22;1;HUM320 G7;
برمجة الشبكات;G1;د. أسامة حلمي - م.م عبدالهادي ;CSC416;11,12,13,44,45;4;CSC416 G1;
برمجة الشبكات;G2;د. أسامة حلمي - م.م دينا;CSC416;14,15,16,47,48;4;CSC416 G2;
برمجة الشبكات;G3;د.  - م.م دينا;CSC416;56,57,58,42,43;4;CSC416 G3;
برمجة الشبكات;G4;د.  - م.م عبدالهادي;CSC416;51,52,53,47,48;4;CSC416 G4;
برمجة الشبكات;G5;د. أسامة حلمي  - م. نادين;CSC416;11,12,13,27,28;4;CSC416 G5;
برمجة الشبكات;G6;د. أسامة حلمي  - م. دينا;CSC416;14,15,16,31,32;4;CSC416 G6;
برمجة الشبكات;G7;د.   - م. نادين;CSC416;56,57,58,14,15;4;CSC416 G7;
برمجة الشبكات;G8;د.   - م.م عبدالهادي;CSC416;51,52,53,41,42;4;CSC416 G8;
هندسة البرمجيات(٢);G1;د. سامح ظريف - م.م منى;CSC414;24,25,26,34,35;4;CSC414 G1;
هندسة البرمجيات(٢);G2;د. سامح ظريف - م.م سارة;CSC414;21,22,23,51,52;4;CSC414  G2;
هندسة البرمجيات(٢);G3;د. مريان وجدي - م.م سارة;CSC414;51,52,53,27,28;4;CSC414 G3;
هندسة البرمجيات(٢);G4;د. مريان وجدي - م.م منى;CSC414;56,57,58,37,38;4;CSC414 G4;
هندسة البرمجيات(٢);G5;د. سامح ظريف - م.م منى;CSC414;24,25,26,31,32;4;CSC414 G5;
هندسة البرمجيات(٢);G6;د. سامح ظريف - م.م منى;CSC414;21,22,23,27,28;4;CSC414 G6;
هندسة البرمجيات(٢);G7;د. مريان وجدي - م.م سارة;CSC414;51,52,53,54,55;4;CSC414 G7;
هندسة البرمجيات(٢);G8;د. مريان وجدي - م.م منى;CSC414;56,57,58,54,55;4;CSC414 G8;
النمذجة والمحاكاه;G1;د.ابراهيم عمارة - م.م  بسنت;CSC411;56,57,58,41,42;3;CSC411 G1;
النمذجة والمحاكاه;G2;د.ابراهيم عمارة - م.م  بسنت;CSC411;53,54,55,31,32;3;CSC411 G2;
النمذجة والمحاكاه;G3;د.ابراهيم عمارة - م.م  بسنت;CSC411;16,17,18,24,25;3;CSC411 G3;
النمذجة والمحاكاه;G4;د.ابراهيم عمارة - م.م  بسنت;CSC411;11,12,13,22,23;3;CSC411 G4;
النمذجة والمحاكاه;G5;د.ابراهيم عمارة - م.م  بسنت;CSC411;56,57,58,51,52;3;CSC411 G5;
النمذجة والمحاكاه;G6;د.ابراهيم عمارة - م.م  بسنت;CSC411;53,54,55,47,48;3;CSC411 G6;
النمذجة والمحاكاه;G7;د.ابراهيم عمارة - م.م كريم;CSC411;16,17,18,34,35;3;CSC411 G7;
النمذجة والمحاكاه;G8;د.ابراهيم عمارة - م.م كريم;CSC411;11,12,13,27,28;3;CSC411 G8;
الذكاء الاصطناعي;G1;أ.م.د.يسرية أبو النجا - م.م نبيل;CSC412;21,22,23,32,33;3;CSC412 G1;
الذكاء الاصطناعي;G2;أ.م.د.يسرية أبو النجا - م.م كريم;CSC412;24,25,26,44,45;3;CSC412 G2;
الذكاء الاصطناعي;G3;أ.م.د.يسرية أبو النجا - م.م نبيل;CSC412;31,32,33,54,55;3;CSC412 G3;
الذكاء الاصطناعي;G4;أ.م.د.يسرية أبو النجا -م.م كريم;CSC412;34,35,36,54,55;3;CSC412 G4;
الذكاء الاصطناعي;G5;أ.م.د.يسرية أبو النجا -م.م كريم;CSC412;21,22,23,47,48;3;CSC412 G5;
الذكاء الاصطناعي;G6;أ.م.د.يسرية أبو النجا -م.م نبيل;CSC412;24,25,26,41,42;3;CSC412 G6;
الذكاء الاصطناعي;G7;أ.م.د.يسرية أبو النجا -م.م كريم;CSC412;31,32,33,24,25;3;CSC412 G7;
الذكاء الاصطناعي;G8;أ.م.د.يسرية أبو النجا -م.م كريم;CSC412;34,35,36,37,38;3;CSC412 G8;
لغة إنجليزية(٥);G1;د.;BSC410;14,15,16;1;BSC410 G1;
لغة إنجليزية(٥);G2;د.;BSC410;34,35,36;1;BSC410 G2;
لغة إنجليزية(٥);G3;د.;BSC410;11,12,13;1;BSC410 G3;
لغة إنجليزية(٥);G4;د.;BSC410;16,17,18;1;BSC410 G4;
لغة إنجليزية(٥);G5;د.;BSC410;14,15,16;1;BSC410 G5;
لغة إنجليزية(٥);G6;د.;BSC410;34,35,36;1;BSC410 G6;
لغة إنجليزية(٥);G7;د.;BSC410;11,12,13;1;BSC410 G7;
لغة إنجليزية(٥);G8;د.;BSC410;16,17,18;1;BSC410 G8;
مقرر اختياري;G1;د. سامح ظريف - م. ايمان;CSC42*;53,54,55,51,52;3;CSC42* G1;
مقرر اختياري;G2;د. سامح ظريف -م. سمر;CSC42*;56,57,58,37,38;3;CSC42* G2;
مقرر اختياري;G3;د. مريان وجدي -م. ايمان;CSC42*;21,22,23,34,35;3;CSC42* G3;
مقرر اختياري;G4;د. مريان وجدي -م. ايمان;CSC42*;24,25,26,41,42;3;CSC42* G4;
مقرر اختياري;G5;د. سامح ظريف -م. سمر;CSC42*;53,54,55,34,35;3;CSC42* G5;
مقرر اختياري;G6;د. سامح ظريف - م.آيه;CSC42*;56,57,58,51,52;3;CSC42* G6;
مقرر اختياري;G7;د. مريان وجدي - م.سمر;CSC42*;21,22,23,44,45;3;CSC42* G7;
مقرر اختياري;G8;د. مريان وجدي - م.سمر;CSC42*;24,25,26,21,22;3;CSC42* G8;
مشروع;G1;د.;CSC400;18;6;CSC400 G1;
مشروع;G2;د.;CSC400;11;6;CSC400 G2;
مشروع;G4;د.;CSC400;21;6;CSC400 G4;
مشروع;G6;د.;CSC400;37;6;CSC400 G6;
مشروع;G7;د.;CSC400;41;6;CSC400 G7;
مشروع;G8;د.;CSC400;48;6;CSC400 G8`

let courseinfojson = `[
    {
        "ccname": "برمجة الشبكات",
        "ccode": "CSC416",
        "unit": "4",
        "groups": [
            {
                "gnumber": "G1",
                "gtimes": "11,12,13,44,45",
                "glecturer": "د. أسامة حلمي - م.م عبدالهادي "
            },
            {
                "gnumber": "G2",
                "gtimes": "14,15,16,47,48",
                "glecturer": "د. أسامة حلمي - م.م دينا"
            },
            {
                "gnumber": "G3",
                "gtimes": "56,57,58,42,43",
                "glecturer": "د.  - م.م دينا"
            },
            {
                "gnumber": "G4",
                "gtimes": "51,52,53,47,48",
                "glecturer": "د.  - م.م عبدالهادي"
            },
            {
                "gnumber": "G5",
                "gtimes": "11,12,13,27,28",
                "glecturer": "د. أسامة حلمي  - م. نادين"
            },
            {
                "gnumber": "G6",
                "gtimes": "14,15,16,31,32",
                "glecturer": "د. أسامة حلمي  - م. دينا"
            },
            {
                "gnumber": "G7",
                "gtimes": "56,57,58,14,15",
                "glecturer": "د.   - م. نادين"
            },
            {
                "gnumber": "G8",
                "gtimes": "51,52,53,41,42",
                "glecturer": "د.   - م.م عبدالهادي"
            }
        ]
    },
    {
        "ccname": "هندسة البرمجيات(٢)",
        "ccode": "CSC414",
        "unit": "4",
        "groups": [
            {
                "gnumber": "G1",
                "gtimes": "24,25,26,34,35",
                "glecturer": "د. سامح ظريف - م.م منى"
            },
            {
                "gnumber": " G2",
                "gtimes": "21,22,23,51,52",
                "glecturer": "د. سامح ظريف - م.م سارة"
            },
            {
                "gnumber": "G3",
                "gtimes": "51,52,53,27,28",
                "glecturer": "د. مريان وجدي - م.م سارة"
            },
            {
                "gnumber": "G4",
                "gtimes": "56,57,58,37,38",
                "glecturer": "د. مريان وجدي - م.م منى"
            },
            {
                "gnumber": "G5",
                "gtimes": "24,25,26,31,32",
                "glecturer": "د. سامح ظريف - م.م منى"
            },
            {
                "gnumber": "G6",
                "gtimes": "21,22,23,27,28",
                "glecturer": "د. سامح ظريف - م.م منى"
            },
            {
                "gnumber": "G7",
                "gtimes": "51,52,53,54,55",
                "glecturer": "د. مريان وجدي - م.م سارة"
            },
            {
                "gnumber": "G8",
                "gtimes": "56,57,58,54,55",
                "glecturer": "د. مريان وجدي - م.م منى"
            }
        ]
    },
    {
        "ccname": "الذكاء الاصطناعي",
        "ccode": "CSC412",
        "unit": "3",
        "groups": [
            {
                "gnumber": "G1",
                "gtimes": "21,22,23,32,33",
                "glecturer": "أ.م.د.يسرية أبو النجا - م.م نبيل"
            },
            {
                "gnumber": "G2",
                "gtimes": "24,25,26,44,45",
                "glecturer": "أ.م.د.يسرية أبو النجا - م.م كريم"
            },
            {
                "gnumber": "G3",
                "gtimes": "31,32,33,54,55",
                "glecturer": "أ.م.د.يسرية أبو النجا - م.م نبيل"
            },
            {
                "gnumber": "G4",
                "gtimes": "34,35,36,54,55",
                "glecturer": "أ.م.د.يسرية أبو النجا -م.م كريم"
            },
            {
                "gnumber": "G5",
                "gtimes": "21,22,23,47,48",
                "glecturer": "أ.م.د.يسرية أبو النجا -م.م كريم"
            },
            {
                "gnumber": "G6",
                "gtimes": "24,25,26,41,42",
                "glecturer": "أ.م.د.يسرية أبو النجا -م.م نبيل"
            },
            {
                "gnumber": "G7",
                "gtimes": "31,32,33,24,25",
                "glecturer": "أ.م.د.يسرية أبو النجا -م.م كريم"
            },
            {
                "gnumber": "G8",
                "gtimes": "34,35,36,37,38",
                "glecturer": "أ.م.د.يسرية أبو النجا -م.م كريم"
            }
        ]
    },
    {
        "ccname": "النمذجة والمحاكاه",
        "ccode": "CSC411",
        "unit": "3",
        "groups": [
            {
                "gnumber": "G1",
                "gtimes": "56,57,58,41,42",
                "glecturer": "د.ابراهيم عمارة - م.م  بسنت"
            },
            {
                "gnumber": "G2",
                "gtimes": "53,54,55,31,32",
                "glecturer": "د.ابراهيم عمارة - م.م  بسنت"
            },
            {
                "gnumber": "G3",
                "gtimes": "36,37,38,24,25",
                "glecturer": "د.ابراهيم عمارة - م.م  بسنت"
            },
            {
                "gnumber": "G4",
                "gtimes": "31,32,33,22,23",
                "glecturer": "د.ابراهيم عمارة - م.م  بسنت"
            },
            {
                "gnumber": "G5",
                "gtimes": "56,57,58,51,52",
                "glecturer": "د.ابراهيم عمارة - م.م  بسنت"
            },
            {
                "gnumber": "G6",
                "gtimes": "53,54,55,47,48",
                "glecturer": "د.ابراهيم عمارة - م.م  بسنت"
            },
            {
                "gnumber": "G7",
                "gtimes": "36,37,38,34,35",
                "glecturer": "د.ابراهيم عمارة - م.م كريم"
            },
            {
                "gnumber": "G8",
                "gtimes": "31,32,33,27,28",
                "glecturer": "د.ابراهيم عمارة - م.م كريم"
            }
        ]
    },
    {
        "ccname": "لغة إنجليزية(٥)",
        "ccode": "BSC410",
        "unit": "1",
        "groups": [
            {
                "gnumber": "G1",
                "gtimes": "14,15,16",
                "glecturer": "د."
            },
            {
                "gnumber": "G2",
                "gtimes": "34,35,36",
                "glecturer": "د."
            },
            {
                "gnumber": "G3",
                "gtimes": "11,12,13",
                "glecturer": "د."
            },
            {
                "gnumber": "G4",
                "gtimes": "11,12,13",
                "glecturer": "د."
            },
            {
                "gnumber": "G5",
                "gtimes": "14,15,16",
                "glecturer": "د."
            },
            {
                "gnumber": "G6",
                "gtimes": "34,35,36",
                "glecturer": "د."
            },
            {
                "gnumber": "G7",
                "gtimes": "11,12,13",
                "glecturer": "د."
            },
            {
                "gnumber": "G8",
                "gtimes": "11,12,13",
                "glecturer": "د."
            }
        ]
    },
    {
        "ccname": "مقرر اختياري",
        "ccode": "CSC42*",
        "unit": "3",
        "groups": [
            {
                "gnumber": "G1",
                "gtimes": "53,54,55,51,52",
                "glecturer": "د. سامح ظريف - م. ايمان"
            },
            {
                "gnumber": "G2",
                "gtimes": "56,57,58,37,38",
                "glecturer": "د. سامح ظريف -م. سمر"
            },
            {
                "gnumber": "G3",
                "gtimes": "21,22,23,34,35",
                "glecturer": "د. مريان وجدي -م. ايمان"
            },
            {
                "gnumber": "G4",
                "gtimes": "24,25,26,41,42",
                "glecturer": "د. مريان وجدي -م. ايمان"
            },
            {
                "gnumber": "G5",
                "gtimes": "53,54,55,34,35",
                "glecturer": "د. سامح ظريف -م. سمر"
            },
            {
                "gnumber": "G6",
                "gtimes": "56,57,58,51,52",
                "glecturer": "د. سامح ظريف - م.آيه"
            },
            {
                "gnumber": "G7",
                "gtimes": "21,22,23,44,45",
                "glecturer": "د. مريان وجدي - م.سمر"
            },
            {
                "gnumber": "G8",
                "gtimes": "24,25,26,21,22",
                "glecturer": "د. مريان وجدي - م.سمر"
            }
        ]
    },
    {
        "ccname": "مشروع",
        "ccode": "CSC400",
        "unit": "6",
        "groups": [
            {
                "gnumber": "G1",
                "gtimes": "18",
                "glecturer": "د."
            },
            {
                "gnumber": "G2",
                "gtimes": "11",
                "glecturer": "د."
            },
            {
                "gnumber": "G3",
                "gtimes": "41",
                "glecturer": "د."
            },
            {
                "gnumber": "G4",
                "gtimes": "21",
                "glecturer": "د."
            },
            {
                "gnumber": "G5",
                "gtimes": "38",
                "glecturer": "د."
            },
            {
                "gnumber": "G6",
                "gtimes": "37",
                "glecturer": "د."
            },
            {
                "gnumber": "G7",
                "gtimes": "41",
                "glecturer": "د."
            },
            {
                "gnumber": "G8",
                "gtimes": "14",
                "glecturer": "د."
            }
        ]
    }
]`


export { CSCoursesCSV , courseinfojson }